# **Trabalho Final**
### Algoritmos e Programação com Linguagem Python
---

**Orientações Gerais:**

* Esta é o trabalho final prático onde serão trabalhados conceitos 
apresentados e exercitados em sala de aula.

* Aspéctos como clareza e organização do código, comentários, raciocínio lógico, coerência no nome de variáveis, utilização das estruturas mais adequadas para a solução dos problemas e o funcionamento adequado serão analisados e irão compor o valor da nota final.

* Procure entender exatamente o que se pede antes de iniciar a codificação. Quando se sabe o que é necessário fazer, a codificação fica mais fácil, mais eficiente e mais divertida ;-).

* Faça o upload do notebook completo nomeado da seguinte forma: *nome_sobrenome_RA.ipynb*. 

* No caso de grupos, informar ao professor os membros de cada grupo e cada um deverá importar o arquivo no Canvas individualmente.

* Arquivos com nomes incorretos serão desconsiderados!

* Não deixem dúvidas para trás! Acessem os grupos combinados ou entrem em contato com o professor. 

✌ Sucesso o/

# RMS Titanic

O RMS Titanic foi um navio de passageiros britânico operado pela White Star Line e construído pelos estaleiros da Harland and Wolff em Belfast. Foi a segunda embarcação da Classe Olympic de transatlânticos depois do RMS Olympic e seguido pelo HMHS Britannic. Projetado pelos engenheiros navais Alexander Carlisle e Thomas Andrews, sua construção começou em março de 1909 e ele foi lançado ao mar em maio de 1911. O Titanic foi pensado para ser o navio mais luxuoso e mais seguro de sua época, gerando lendas que era supostamente "inafundável".

A embarcação partiu em sua viagem inaugural de Southampton para Nova Iorque em 10 de abril de 1912, no caminho passando em Cherbourg-Octeville na França e por Queenstown na Irlanda. Ele colidiu com um iceberg às 23h40min do dia 14 de abril e afundou na madrugada do dia seguinte matando mais de 1500 pessoas, sendo um dos maiores desastres marítimos em tempos de paz de toda a história. Seu naufrágio destacou vários pontos fracos de seu projeto, deficiências nos procedimentos de evacuação de emergência e falhas nas regulamentações marítimas da época. Comissões de inquérito foram instauradas nos Estados Unidos e no Reino Unido, levando a mudanças nas leis internacionais de navegação que permanecem em vigor mais de um século depois.

Os destroços do Titanic foram procurados por décadas até serem encontrados em 1985 por uma equipe liderada por Robert Ballard. Ele se encontra a 3843 m de profundidade e a 650 km ao sudeste de Terra Nova no Canadá. Sua história e naufrágio permaneceram no imaginário popular durante décadas, levando a produção de vários livros e filmes a seu respeito, mais notavelmente o filme Titanic de 1997. Até hoje o Titanic permanece como um dos navios mais famosos da história, com seus destroços atraindo várias expedições de exploração ao longo dos anos.

*Fonte:* [WikiPedia](https://pt.wikipedia.org/wiki/RMS_Titanic)

--------

A equipe da [Udacity](https://udacity.com) disponibilizou informações sobre uma parte dos passageiros à bordo do RMS Titanic no dia daquela tragédia. Esse _dataset_ que contém informações reais vem sendo utilizado em diversos estudos de caso, além de servir de base para aprendizado de Ciência de Dados, Estatística e Machine Learning.

O arquivo **titanic_data.csv** contém informações reais sobre os passageiros organizadas da seguinte forma:

- Survived (Sobreviveu): 0 = Não, 1 = Sim
- Pclass (Classe): Classe de ingresso 1 = 1º, 2 = 2º, 3 = 3º
- Sex (Sexo): Sexo do passageiro
- Age (Idade): Idade em anos
- Sibsp: Quantidade de irmãos / cônjuges a bordo do Titanic
- Parch: Quantidade de pais / crianças a bordo do Titanic
- Ticket (Bilhete): Número do bilhete de embarque
- Fare (Tarifa): Tarifa paga pelo Passageiro
- Cabin (Cabine): Número de cabine
- Embarked (Embarque): Porto de Embarque (C = Cherbourg, Q = Queenstown, S = Southampton)

O objetivo deste estudo é obter algumas informações estatísticas sobre a tragédia e realizar alguns _insights_ a respeito dos tripulantes e das circunstâncias do acidente.

Efetue a carga do arquivo através da biblioteca _Pandas_ e a partir do _DataFrame_ gerado, efetue as operações necessárias para responder as questões.

## Importando o DataSet

1 - Efetuar a leitura do dataset através do Pandas, gerando um DataFrame de nome tit, levando-se em consideração que o arquivo encontra-se na mesma pasta do notebook.

In [ ]:
import pandas as pd
import numpy as np

df = pd.read_csv('/content/titanic_data.csv')

## Conhecendo o DataSet

2 - Quantas linhas e colunas tem o dataset? Quais os tipos das colunas?

In [ ]:
df.shape

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

3 - Mostre os dados dos dez primeiros e 8 últimos registros do dataset.

In [ ]:
df.head(10)

df.tail(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.500,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

4 - Cálculos envolvendo colunas numéricas com dados faltantes podem sofrer impacto. É possível afirmar se há dados faltantes no dataset? Caso positivo, quais e quantos seriam esses dados? Preencha os dados faltantes de forma que não influenciem em operações futuras.

In [ ]:
df.isna().sum()

df.fillna(0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0.0,1,2,W./C. 6607,23.4500,0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,0,Q

## Adequando o DataSet

5 - Uma vez que algumas colunas não serão utilizadas, eventualmente é melhor excluí-las para que não interfiram na análise. Assim, exclua do dataset as colunas Sibsp, Parch e Ticket.

In [ ]:
df.columns

df2 = df.drop(columns = ['SibSp', 'Parch', 'Ticket'])

df2.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

6 - Renomear as colunas restantes para a lingua portuguesa, utilizando os seguintes nomes de colunas: IdPassageiro, Sobreviveu, Classe, Nome, Sexo, Idade, Tarifa, Cabine e Embarque.

In [ ]:
df2.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade', 'Tarifa', 'Cabine', 'Embarque']
df2

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,NaN,Q

7 - Alterar o conteudo da coluna Sobreviveu para:
- 0 => Não
- 1 => Sim

In [ ]:
df2.loc[df2.Sobreviveu == 1, 'Sobreviveu'] = 'Sim'
df2.loc[df2.Sobreviveu == 0, 'Sobreviveu'] = 'Não'
df2['Sobreviveu']

0      Não
1      Sim
2      Sim
3      Sim
4      Não
      ...
886    Não
887    Sim
888    Não
889    Sim
890    Não
Name: Sobreviveu, Length: 891, dtype: object

8 - Alterar o conteudo da coluna Sexo para:
- female => Mulher
- male   => Homem

In [ ]:
df2.loc[df2.Sexo == 'female', 'Sexo'] = 'Mulher'
df2.loc[df2.Sexo == 'male', 'Sexo'] = 'Homem'
df2['Sexo']

0       Homem
1      Mulher
2      Mulher
3      Mulher
4       Homem
        ...
886     Homem
887    Mulher
888    Mulher
889     Homem
890     Homem
Name: Sexo, Length: 891, dtype: object

## Alguns números

9 - Quantas mulheres e quantos homems estavam à bordo, de acordo com o dataset?

In [ ]:
df2['Sexo'].value_counts()

Homem     577
Mulher    314
Name: Sexo, dtype: int64

10 - Quantos passageiros sobreviveram e quantos não sobreviveram?

In [ ]:
df2['Sobreviveu'].value_counts()

Não    549
Sim    342
Name: Sobreviveu, dtype: int64

11 - Quantas mulheres não sobreviveram?

In [ ]:
df3 = df2[
       (df2['Sexo'] == 'Mulher') & (df2['Sobreviveu'] == 'Não')
       ]
df3['Sexo'].value_counts()

Mulher    81
Name: Sexo, dtype: int64

12 - Proporcionalmente, sobreviveram mais homens ou mais mulheres? Cite as proporções.

In [ ]:
df4 = df2[(df2['Sexo'] == 'Mulher') & (df2['Sobreviveu'] == 'Sim')]
df5 = df2[(df2['Sexo'] == 'Homem') & (df2['Sobreviveu'] == 'Sim')]
df2_h = df2[(df2['Sexo'] == 'Homem')]
df2_m = df2[(df2['Sexo'] == 'Mulher')]

df5['Sexo'].value_counts()
df4['Sexo'].value_counts()
df2_h['Sexo'].value_counts()
df2_m['Sexo'].value_counts()

Mulher    314
Name: Sexo, dtype: int64

In [ ]:
df_ph = (df5['Sexo'].value_counts() / df2_h['Sexo'].value_counts()) * 100
df_ph.round(2)

df_pm = (df4['Sexo'].value_counts() / df2_m['Sexo'].value_counts()) *100
df_pm.round(2)

Mulher    74.2
Name: Sexo, dtype: float64

13 - Levando-se em consideração a idade dos passageiros, qual a idade e quantidade de pessoas com o maior número de mortos?

In [ ]:
df2['Idade'].mode()

0    24.0
dtype: float64

In [ ]:
df6 = df2[(df2['Idade'] == 24) & (df2['Sobreviveu'] == 'Não')]
df6['Sobreviveu'].value_counts()

Não    15
Name: Sobreviveu, dtype: int64

14 - Qual a média de idade dos homens sobreviventes?

In [ ]:
df7 = df5['Idade'].agg([np.mean])
df7.round(2)

mean    27.28
Name: Idade, dtype: float64

15 - Levando-se em consideração passageiros prioritários (mulheres e crianças de até 15 anos independente do sexo) qual a proporção de sobreviventes por sexo?

In [ ]:
df8 = df2[(df2['Idade'] <= 15) & (df2['Sobreviveu'] == 'Sim')]
df8['Sobreviveu'].value_counts()

Sim    49
Name: Sobreviveu, dtype: int64

In [ ]:
df9 = df8[(df8['Sexo'] == 'Mulher') & (df8['Sobreviveu'] == 'Sim')]
df9['Sexo'].value_counts()

Mulher    28
Name: Sexo, dtype: int64

In [ ]:
df10 = (df8['Sobreviveu'].value_counts() - df9['Sobreviveu'].value_counts())
df10

Sim    21
Name: Sobreviveu, dtype: int64

In [ ]:
propor_h = ( 21 / df2_h['Sexo'].value_counts()) * 100
propor_h.round(2)

Homem    3.64
Name: Sexo, dtype: float64

In [ ]:
propor_m = ( 28 / df2_m['Sexo'].value_counts() ) * 100
propor_m.round(2)

Mulher    8.92
Name: Sexo, dtype: float64

16 - Qual a quantidade de passageiros por classe?

In [ ]:
df2['Classe'].value_counts()

3    491
1    216
2    184
Name: Classe, dtype: int64

17 - Qual o percentual de sobreviventes por classe?

In [ ]:
df11 = df2[(df2['Classe'] == 1) & (df2['Sobreviveu'] == 'Sim')]
df12 = df2[(df2['Classe'] == 2) & (df2['Sobreviveu'] == 'Sim')]
df13 = df2[(df2['Classe'] == 3) & (df2['Sobreviveu'] == 'Sim')]
df14 = df2[(df2['Sobreviveu'] == 'Sim')]

df14['Sobreviveu'].value_counts()

Sim    342
Name: Sobreviveu, dtype: int64

In [ ]:
dfpCl1 = (df11['Sobreviveu'].value_counts() / df14['Sobreviveu'].value_counts()) *100 
dfpCl1.round(2)

Sim    39.77
Name: Sobreviveu, dtype: float64

In [ ]:
dfpCl2 = (df12['Sobreviveu'].value_counts() / df14['Sobreviveu'].value_counts()) *100 
dfpCl2.round(2)

Sim    25.44
Name: Sobreviveu, dtype: float64

In [ ]:
dfpCl3 = (df13['Sobreviveu'].value_counts() / df14['Sobreviveu'].value_counts()) *100 
dfpCl3.round(2)

Sim    34.8
Name: Sobreviveu, dtype: float64

18 - Crie um dataframe que demonstre a quantidade de sobreviventes e não sobreviventes, agrupados por sexo e classe.

In [ ]:
novo_agrupamento = df2.groupby(['Sobreviveu', 'Sexo', 'Classe']).size().unstack()
novo_agrupamento

Classe              1   2    3
Sobreviveu Sexo
Não        Homem   77  91  300
           Mulher   3   6   72
Sim        Homem   45  17   47
           Mulher  91  70   72

19 - Dos homens com idade entre 24 e 30 anos quantos da classe 3 sobreviveram? Quantos da classe 2 não sobreviveram?

In [ ]:
dados = df2[(df2['Idade'] >= 24) & (df2['Idade'] >= 30) & (df2['Sexo'] == 'Homem')]
dados.groupby(['Classe', 'Sobreviveu']).size().unstack()

Sobreviveu  Não  Sim
Classe
1            49   27
2            47    5
3            78   10

20 - Calcule a probabilidade condicional de uma pessoa sobreviver, dado seu sexo e a classe em que estava viajando:
- P(S= true | G=female,C=1)
- P(S= true | G=female,C=2)
- P(S= true | G=female,C=3)
- P(S= true | G=male,C=1)
- P(S= true | G=male,C=2)
- P(S= true | G=male,C=3)

In [ ]:
novo = df2.groupby(['Sobreviveu', 'Sexo', 'Classe']).size().unstack()
df20 = df2[(df2['Classe'] == 1) & (df2['Sobreviveu'] == 'Sim') & (df2['Sexo'] == 'Mulher')]
df21 = df2[(df2['Classe'] == 1) & (df2['Sexo'] == 'Mulher')]
df20['Sobreviveu'].value_counts()

df22 = (df20['Classe'].value_counts() / df21['Classe'].value_counts()) * 100
df22.round(2)

In [271]:
dado = df2[(df2['Sobreviveu'] == 'Sim')]
dado.groupby(['Sobreviveu', 'Sexo', 'Classe']).size()

novo_agrupamento = df2.groupby(['Sexo', 'Classe']).size()
novo_agrupamento

conta = (dado.groupby(['Sobreviveu', 'Sexo', 'Classe']).size() / df2.groupby(['Sexo', 'Classe']).size()) * 100
conta.round(2)

Sobreviveu  Sexo    Classe
Sim         Homem   1         36.89
                    2         15.74
                    3         13.54
            Mulher  1         96.81
                    2         92.11
                    3         50.00
dtype: float64